# Do as directed:

In [24]:
import numpy as np
import pandas as pd

In [25]:
df = pd.DataFrame(np.random.randn(5,4),index="A B C D E".split(), columns = "W X Y Z".split())
df

          W         X         Y         Z
A -0.305793 -0.347545 -0.186346 -0.584161
B  0.104195  2.288965 -0.424056  0.110050
C  0.185413  0.501691 -0.491041 -0.863264
D -0.380614  0.515821  0.342161 -1.129681
E  1.262253 -1.001466 -0.885349 -0.750432

In [26]:
# df1 = pd.DataFrame([["Abhie","Abhie","Abhie","Abhie","Abhie"],[1,2,2,2,2]], index=[i for i in range(7, 12)], columns=["Name"])

In [27]:
df2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index=[i for i in range(5,8)], columns=[9,9,9])
df2

   9  9  9
5  1  2  3
6  4  5  6
7  7  8  9

# Task 2

## Preprocessing

In [2]:
import pandas as pd

In [3]:
sal = pd.read_csv('datasets/Salaries.csv', low_memory = False)

In [4]:
sal

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [5]:
sal.describe()

                  Id       TotalPay  TotalPayBenefits           Year  Notes
count  148654.000000  148654.000000     148654.000000  148654.000000    0.0
mean    74327.500000   74768.321972      93692.554811    2012.522643    NaN
std     42912.857795   50517.005274      62793.533483       1.117538    NaN
min         1.000000    -618.130000       -618.130000    2011.000000    NaN
25%     37164.250000   36168.995000      44065.650000    2012.000000    NaN
50%     74327.500000   71426.610000      92404.090000    2013.000000    NaN
75%    111490.750000  105839.135000     132876.450000    2014.000000    NaN
max    148654.000000  567595.430000     567595.430000    2014.000000    NaN

In [6]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [7]:
sal.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [8]:
sal.shape

(148654, 13)

In [9]:
sal.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [10]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

---
## Handling Missing Values
---
- `isnull()` - selects NaN or None
- `notnull()`
- `dropna()` - removes entire row
- `dropna(axis = 1)` - removes entire column
- `dropna(thresh=2)` - removes data if data >= 2
- `fillna(value = 0)`
    - `fillna(df.marks.mean())`
    - `fillna(method = 'ffill')` - ffill - forward filling - previous value to NaN
    - `fillna(method = 'bfill')` - ffill - backward filling - next value to NaN
    - `fillna(method = 'pad')` -
- eg: `df.replace(toreplace = 'Not Provided', 'NaN')`
#### Interpolation - process of determining unknown data points between two known data points.

In [38]:
#fill nan with 0
sal = sal.fillna(0)

In [39]:
#convert non zero to 0
sal['OtherPay'] = sal['OtherPay'].replace('Not Provided', '0.00')
sal['BasePay'] = sal['BasePay'].replace('Not Provided', '0.00')
sal['OvertimePay'] = sal['OvertimePay'].replace('Not Provided', '0.00')
sal['Benefits'] = sal['Benefits'].replace('Not Provided', '0.00')
sal['OtherPay'] = sal['OtherPay'].astype(float)
sal['BasePay'] = sal['BasePay'].astype(float)
sal['OvertimePay'] = sal['OvertimePay'].astype(float)
sal['Benefits'] = sal['Benefits'].astype(float)

In [40]:
sal.dtypes

Id                    int64
EmployeeName         object
JobTitle             object
BasePay             float64
OvertimePay         float64
OtherPay            float64
Benefits            float64
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
Notes               float64
Agency               object
Status               object
dtype: object

# Tasks

### 1. Import pandas as pd.

In [41]:
import pandas as pd

### 2. Read Salaries.cs as a dataframe called sal.

In [42]:
#sal69 = pd.read_csv('datasets/Salaries.csv', low_memory = False)

### 3. Check the head of the DataFrame.

In [43]:
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,0.0,567595.43,567595.43,2011,0.0,San Francisco,0
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,0.0,538909.28,538909.28,2011,0.0,San Francisco,0
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,0.0,335279.91,335279.91,2011,0.0,San Francisco,0
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,0.0,332343.61,332343.61,2011,0.0,San Francisco,0
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,0.0,326373.19,326373.19,2011,0.0,San Francisco,0

### 4. Use the info() method to find out how many entries there are.

In [17]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148654 non-null  float64
 4   OvertimePay       148654 non-null  float64
 5   OtherPay          148654 non-null  float64
 6   Benefits          148654 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             148654 non-null  float64
 11  Agency            148654 non-null  object
 12  Status            148654 non-null  object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

### 5. What is the average BasePay ?

In [18]:
sal['BasePay'].mean()

66053.72928807836

### 6. What is the highest amount of OvertimePay in the dataset ?

In [19]:
sal['OvertimePay'].max()

245131.88

### 7. What is the job title of JOSEPH DRISCOLL? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

In [20]:
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

### 8. How much does JOSEPH DRISCOLL make (including benefits)?

In [21]:
print("Joseph Driscoll's Total Pay including benefits:",sum(sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']))

Joseph Driscoll's Total Pay including benefits: 270324.91

### 9. What is the name of highest paid person (including benefits)?

In [22]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].max()]['EmployeeName']

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

### 10. What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [23]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

### 11. What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [24]:
sal.groupby('Year')['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    68509.832156
2014    66557.437750
Name: BasePay, dtype: float64

### 12. How many unique job titles are there?

In [25]:
sal['JobTitle'].nunique()

2159

### 13. What are the top 5 most common jobs?

In [26]:
jobTitleCount = sal['JobTitle'].value_counts()
jobTitleCount.nlargest(5)

JobTitle
Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: count, dtype: int64

### 14. How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [27]:
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

### 15. How many people have the word Chief in their job title?

In [28]:
sal[sal['JobTitle'].str.contains("Chief")].shape[0]

423

### 16. Is there a correlation between length of the Job Title string and Salary?

No

In [30]:
sum(sal['JobTitle'].apply(lambda x: 'chief' in x.lower()))

627